package org.example;

/** Задание 2.2.
 * Необходимо написать программу – розыгрыша игрушек в магазине детских товаров.
 * Желательный функционал программы:
 * > В программе должен быть минимум один класс со следующими свойствами:
 *    - id игрушки,
 *    - текстовое название,
 *    - количество
 *    - частота выпадения игрушки (вес в % от 100)
 * > Метод добавление новых игрушек и возможность изменения веса (частоты выпадения игрушки)
 * > Возможность организовать розыгрыш игрушек.
 */
public class Main {
    public static void main(String[] args) {
        
    }
}